# Pandas

Pandas is widely used for Data Analysis. Pandas is like an extremely powerful version of Excel, with a lot more features:

- Series
- DataFrames
- Missing Data
- Group By
- Merging,Joining,and Concatenating
- Operations
- Data Input and Output

#### Importing the libraries

In [1]:
import numpy as np
import pandas as pd

## Series

A Series data type is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

### Creating a Series

In [2]:
# list 1
labels = ['a', 'b', 'c']
# list 2
my_data = [10, 20, 30]
# NumPy array
arr = np.array(my_data)
# Dictionary
d = {'a': 10, 'b': 20, 'c': 30}

#### Creating Series by List

In [3]:
series = pd.Series(data=my_data)

In [4]:
series

0    10
1    20
2    30
dtype: int64

#### Creating Series by List with labels

Labeled index Series (instead of a by default indexed numpy array, now we have a custom labeled indexed series/array)

In [5]:
series1 = pd.Series(data=my_data, index=labels)

In [6]:
series1

a    10
b    20
c    30
dtype: int64

#### Creating Series by List with labels (quick way)

In [7]:
series2 = pd.Series(my_data, labels)

In [8]:
series2

a    10
b    20
c    30
dtype: int64

#### Creating Series by NumPy array

In [9]:
series3 = pd.Series(arr)

In [10]:
series3

0    10
1    20
2    30
dtype: int64

#### Creating Series by NumPy array with labels

In [11]:
series4 = pd.Series(arr, labels)

In [12]:
series4

a    10
b    20
c    30
dtype: int64

#### Creating Series by Dictionary (key --> index, value --> corresponding data point)

In [13]:
series5 = pd.Series(d)

In [14]:
series5

a    10
b    20
c    30
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types

#### Series by strings (object = string)

In [15]:
series6 = pd.Series(labels)

In [16]:
series6

0    a
1    b
2    c
dtype: object

#### Series by functions

In [17]:
series7 = pd.Series(data=[sum, print, len])

In [18]:
series7

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

### Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

#### Creating ser1

In [19]:
ser1 = pd.Series(data=[1, 2, 3, 4], index=['USA', 'Germany', 'USSR', 'Japan'])

In [20]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

#### Creating ser2

In [21]:
ser2 = pd.Series([1, 2, 5, 4], index=['USA', 'Germany', 'Italy', 'Japan'])

In [22]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

#### Grabbing an index point

In [23]:
ser1['USA']

1

#### Adding Series

Operations can also be done based off of index

In [24]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. DataFrame is like a bunch of Series objects put together to share the same index.

In [25]:
from numpy.random import randn

In [26]:
np.random.seed(101)  # see exact the same numbers as running this by your own

#### Creating DataFrame

In [27]:
df = pd.DataFrame(data=randn(5, 4), index=['A', 'B', 'C', 'D', 'E'], columns=['W', 'X', 'Y', 'Z'])

In [28]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
type(df)

pandas.core.frame.DataFrame

### Selection and Indexing

Various methods to grabbing data from a DataFrame

#### Grabbing column

DataFrame Columns are just Series

In [30]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [31]:
type(df['W'])

pandas.core.series.Series

#### Grabbing column pt. 2 (like SQL Syntax --> not recommended)

In [32]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [33]:
type(df.W)

pandas.core.series.Series

#### Grabbing several columns (list of columns)

In [34]:
df[['W', 'Y', 'Z']]  # be careful: double set of brackets

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965
C -2.018168  0.528813 -0.589001
D  0.188695 -0.933237  0.955057
E  0.190794  2.605967  0.683509

#### Creating a new column

In [35]:
df['new'] = df['W'] + df['Y']

In [36]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

#### Removing Columns

In [37]:
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

This actually does not remove the column from the actual dataframe. To do this, you have to specify the "inplace=True" argument inside the drop() method. See below. (axis=1 means columns)

#### Removing Columns in the actual DataFrame

Removing Columns into actual dataframe by specifying the "inplace=True" argument inside the drop() method

In [39]:
df.drop('new', axis=1, inplace=True)  # inplace=True included

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Dropping rows by this way

In [41]:
df.drop('E', axis=0)  # OR df.drop('E') --> axis=0 by default (axis=0 means rows)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

#### Checking the shape of the dataframe

In [42]:
df.shape

(5, 4)

It returns a tuple: (rows, columns), where x is in index 0, and y is in index 1. That's why axis=0 refers to rows and axis=1 refers to columns

#### Selecting Rows

In [43]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

#### Selecting Rows by index

In [44]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

#### Selecting subset of rows and columns

In [45]:
df.loc['B', 'Y']  # just one element

-0.8480769834036315

In [46]:
df.loc[['A', 'B'], ['W', 'Y']]  # a subset of elements

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection

An important feature of Pandas is conditional selection using bracket notation. It is very similar to NumPy.

#### Comparison operator

In [47]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

Getting the actual values:

In [48]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Comparison operator in columns

In [49]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

Getting the actual values (W > 0):

In [50]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Getting the actual values (Z < 0):

In [51]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

Getting the actual values --> W > 0 and only the X column (part 1):

In [52]:
resultdf = df[df['W'] > 0]

In [53]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

Getting the actual values --> W > 0 and only the X column (part 2):

In [54]:
df[df['W'] > 0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

Getting the actual values --> W > 0 and only the X anx Z columns:

In [55]:
df[df['W'] > 0][['X', 'Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

#### MULTIPLE CONDITIONS

For two conditions the | and & with parenthesis can be used.

MULTIPLE CONDITIONS - AND:

In [56]:
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

MULTIPLE CONDITIONS - OR:

In [57]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Index Details

#### Reseting index so that the initialized index is transferred to a column and then the index is a numerical (actual) index column

In [58]:
df.reset_index()  # if someone wants to inplace the new dataframe, she must set the argument: inplace=True

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

#### Setting a new index to the dataframe

In [59]:
 newind = 'CA NY WY OR CO'.split()  # splitting the string into a list (later used for the new index)

In [60]:
# 1) New index values:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [61]:
# 2) Setting up a new column to the DataFrame with the name <States>:
df['States'] = newind

In [62]:
# 3) DataFrame now:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [63]:
# 4) Assigning the <States> column as an index:
df.set_index('States')  # if we want to inplace the new DataFrame we set the argument: inplace=True

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [64]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [65]:
# 05) if we want to inplace the new DataFrame we set the argument: inplace=True'
df.set_index('States', inplace=True)

In [66]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### Multi-Index and Index Hierarchy

#### Creating an example to see of how a Multi-Indexed DataFrame would look like:

In [67]:
# Index Levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]

In [68]:
# zip() --> merges two lists into touples -- list() makes a list
hier_index = list(zip(outside, inside))

In [69]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

pd.MultiIndex.from_tuples() --> customization function for making a dataframe: transforms a list of tuples to a multi index:

In [70]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [71]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

Creating the dataframe with Multi-level index:

In [72]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])  # data, index, columns

OR: df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [73]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

For index hierarchy , df.loc[] is used. If this was on the columns axis, normal bracket notation df[] should be used.

#### Grabbing the G1 level

In [74]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

#### Grabbing the G1 --> 1 level

In [75]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

#### Naming the Indices

In [76]:
df.index.names  # result [None, None] --> i.e. indices have no names

FrozenList([None, None])

#### Setting indices names

In [77]:
df.index.names = ['Groups', 'Numbers']

In [78]:
df

                       A         B
Groups Numbers
G1     1        0.302665  1.693723
       2       -1.706086 -1.159119
       3       -0.134841  0.390528
G2     1        0.166905  0.184502
       2        0.807706  0.072960
       3        0.638787  0.329646

#### Grabbing a single value

In [79]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

#### Cross section - Can be used when we have a Multi-level index

In [80]:
df.xs('G1')

                A         B
Numbers
1        0.302665  1.693723
2       -1.706086 -1.159119
3       -0.134841  0.390528

#### Grabbing a row from a group of Multi-Level index DataFrame

In [81]:
df.xs(['G1', 1])

A    0.302665
B    1.693723
Name: (G1, 1), dtype: float64

#### Grabbing same inner rows ((G1, 1) and (G2, 1)) from a group of Multi-Level index dataframe

In [82]:
df.xs(1, level='Numbers')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

### Missing Data

Convenient methods to dealing with Missing Data in Pandas

#### Creating Dataframe with dictionary as an input. Adding also with np.nan method, the MISSING values

In [83]:
df = pd.DataFrame({'A': [1, 2, np.nan],
                   'B': [5, np.nan, np.nan],
                   'C': [1, 2, 3]})

In [84]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### Dropping NaN or Null values with entire rows that include them --> dropna()

In [85]:
df.dropna()

     A    B  C
0  1.0  5.0  1

#### Drop NaN or Null values with entire columns that include them

In [86]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

#### Dropping NaN or Null values with entire rows that include them with a number of NaN threshold, i.e.: dropping rows that include NaN >= threshold)

In [87]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

#### Filling in the Missing Values --> fillna()

In [88]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

#### Filling in the Missing Values of a column with the MEAN of the other values of that column

In [89]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby

The groupby method allows to group rows of data together and call aggregate functions

#### Creating DataFrame

In [90]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
            'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
            'Sales': [200, 120, 340, 124, 243, 350]}

In [91]:
df = pd.DataFrame(data=data)

In [92]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

Now, the .groupby() method can be used to group rows together based on a column name. 

For example below is a groupby usage, based on Company. This will create a DataFrameGroupBy object, and the Groupby object position in memory:

In [93]:
df.groupby('Company')  # shows where the groupby object is stored in memory

#### GroupBy Object

In [94]:
byComp = df.groupby('Company')

#### Aggregation: mean()

In [95]:
byComp.mean()  # some aggregation function, here: mean() (ignores if a column is non numeric)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

#### Aggregation: sum()

In [96]:
byComp.sum()  # some aggregation function, here: sum() (ignores if a column is non numeric)

         Sales
Company
FB         593
GOOG       320
MSFT       464

#### Aggregation: std()

In [97]:
byComp.std()  # some aggregation function, here: std() (ignores if a column is non numeric)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

#### Aggregation: sum() --> taking the value of a row (e.g. here, FB):

In [98]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

#### Groupby, Aggregation: putting them all in one line

In [99]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

#### Aggregation: count()

In [100]:
byComp.count()  # counts the number of instances for a column

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

#### Aggregation: max()

In [101]:
byComp.max()  # returns also strings, were max value is the maximum letter in alphabet

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

#### Aggregation: min()

In [102]:
byComp.min()  # returns also strings, were min value is the earliest letter in alphabet

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

#### Aggregation: describe() --> gives a bunch of statistical information

In [103]:
byComp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

#### Aggregation: describe() --> gives a bunch of statistical information --> transpose()

In [104]:
byComp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

#### Aggregation: describe() --> gives a bunch of statistical information --> transpose() --> just a single column

In [105]:
byComp.describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

### Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating.

#### Example DataFrames part 01

In [106]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [107]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [108]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [109]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### Concatenation

Concatenation basically glues together DataFrames. Dimensions should match along the axis you are concatenating on. You can use *pd.concat* and pass in a list of DataFrames to concatenate together:

Concatenation: concat() (vertical)

In [110]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Concatenation: concat() --> argument axis=1

In [111]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

Beware of your data when concatenating, so that concatenation is right and you will not be missing of data

#### Example DataFrames part 02

In [112]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [113]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [114]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

#### MERGING: The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together

In [115]:
pd.merge(left, right, how='inner', on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

##### Showing a more complicated example:

In [116]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [117]:
left

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1

In [118]:
right

    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K2   K0

##### INNER join/merge (check SQL's INNER JOIN)

In [119]:
pd.merge(left, right, on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

##### OUTER join/merge (check SQL's OUTER JOIN)

In [120]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

##### RIGHT join/merge (check SQL's RIGHT JOIN)

In [121]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

##### LEFT join/merge (check SQL's LEFT JOIN)

In [122]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

#### JOINING

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame. 
    
join() method here is like merge but it merges the index of the Dataframes instead of a column.

##### Creating DataFrames:

In [123]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                    index=['K0', 'K1', 'K2'])

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])

In [124]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [125]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

##### LEFT JOIN (index)

In [126]:
left.join(right, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

##### RIGHT JOIN (index)

In [127]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Operations

##### Creating DataFrame

In [128]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

##### Info on Unique Values

Unique values of col2:

In [129]:
df['col2'].unique()

array([444, 555, 666])

Checking the number of unique values:

In [130]:
len(df['col2'].unique())

3

Checking the number of unique values (better way):

In [131]:
df['col2'].nunique()

3

Returning a table with the value of how many times a unique value is appeared in a column:

In [132]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

##### Selecting Data

Selecting from DataFrame using criteria from multiple columns:

In [133]:
newdf = df[(df['col1'] > 2) & (df['col2'] == 444)]

In [134]:
newdf

   col1  col2 col3
3     4   444  xyz

##### Applying Functions

Decline a function:

In [135]:
def times2(x):
    return x * 2

Applying the custom function inside a column's values of the DataFrame --> apply('custom function'):

In [136]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

Applying a built-in function inside a column's values of the DataFrame. Here, checking the *len* of a string for each cell in a column:

In [137]:
df['col3'].apply(len)  # check the len of a string for each cell in a column

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

Applying the sum() function inside a column's values of the DataFrame:

In [138]:
df['col1'].sum()

10

##### apply() combined with lambda expressions in DataFrame column

A lambda function is a small anonymous function.
    A lambda function can take any number of arguments, but can only have one expression.
    
        Syntax --> lambda arguments : expression --> e.g.:       
            x = lambda a : a + 10
            print(x(5))
            >> 15

In [139]:
df['col2'].apply(lambda x: x * 2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

##### Removing a column:

In [140]:
df.drop('col1', axis=1)  # specify the column | extra argument: inplace=True (drops permanently the column)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

##### Permanently Removing a Column:

In [141]:
del df['col1']

In [142]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

##### Getting column and index names:

In [143]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [144]:
df.index

RangeIndex(start=0, stop=4, step=1)

##### Sorting and Ordering a DataFrame

df

In [145]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

##### Finding Null Values or Check for Null Values

In [146]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

##### Dropping rows with NaN Values

In [147]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

##### Filling in NaN values with something else:

Creating new DataFrame:

In [148]:
df = pd.DataFrame({'col1': [1, 2, 3, np.nan],
                   'col2': [np.nan, 555, 666, 444],
                   'col3': ['abc', 'def', 'ghi', 'xyz']})

In [149]:
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

Filling the NaN values:

In [150]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

##### Creating Pivot table

In [151]:
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
        'B': ['one', 'one', 'two', 'two', 'one', 'one'],
        'C': ['x', 'y', 'x', 'y', 'x', 'y'],
        'D': [1, 3, 2, 5, 4, 1]}

In [152]:
df = pd.DataFrame(data)

In [153]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [154]:
# A and B columns convert the dataframe to a multi index
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Data Input and Output

Reference code for getting input and output. Pandas can read a variety of file types using its pd.read_ methods.

#### Read/Write CSV files

open/read CSV file:

In [155]:
df = pd.read_csv('example.csv')

In [156]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

write CSV file:

In [157]:
df.to_csv('my_example_copy.csv', index=False)  # index=False --> because I don't want to save index as a column in CSV

reading now the new CSV I made:

In [158]:
pd.read_csv('my_example_copy.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### Excel (Read/Write Excel files)

Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images  or macros may cause this read_excel method to crash. To avoid some crashes, if you not use Anaconda distribution install: *pip install xlrd*

read/open Excel file:

In [159]:
pd.read_excel('Excel_Sample.xlsx', sheetname='Sheet1')  # Don't forget to pass the name of the Sheet you work

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

write Excel file:

In [160]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='Pantelis_Sheet')

reading now the new Excel file I made:

In [161]:
pd.read_excel('Excel_Sample2.xlsx', sheetname='Pantelis_Sheet')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### HTML


You may need to install htmllib5, lxml, and BeautifulSoup4. In your terminal/command prompt run:
    
    conda install lxml (or pip install)
    conda install html5lib (or pip install)
    conda install BeautifulSoup4 (or pip install)
    
Then restart Jupyter Notebook. (or use pip install if you aren't using the Anaconda Distribution) Pandas can read table tabs off of html.

##### HTML Input

Pandas read_html function will read TABLES off of a webpage and return a list of DataFrame objects

In [162]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [163]:
type(data)  # check data type

list

The actual data of list we want, are pointed to index 0, and which are a DataFrame:

In [164]:
dataframeHTML = data[0]

In [165]:
dataframeHTML.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","June 5, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 1, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"

#### SQL

Note: If you are completely unfamiliar with SQL you can check out my other course: "Complete SQL Bootcamp" to learn SQL.

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce  dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will  need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Python’s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.

If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect to the Python DB-API.


    The key functions are:

    read_sql_table(table_name, con[, schema, ...])
        Read SQL database table into a DataFrame.
    read_sql_query(sql, con[, index_col, ...])
        Read SQL query into a DataFrame.
    read_sql(sql, con[, index_col, ...])
        Read SQL query or database table into a DataFrame.
    DataFrame.to_sql(name, con[, flavor, ...])
        Write records stored in a DataFrame to a SQL database.
        
        
NOTE: Pandas is not the best way to read SQL data. It is better to use the default drivers of each type of database you use.

##### making a temporary SQL engine stored in memory

In [166]:
from sqlalchemy import create_engine

In [167]:
engine = create_engine('sqlite:///:memory:')

##### saving data to a table called 'data'

In [168]:
df.to_sql('data', engine)  # table name: data | stored in <engine> connection in database <memory>

##### reading the data from db:

In [169]:
sql_df = pd.read_sql('data', con=engine)

In [170]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15